app/controllers/listings_controller.rb

INSERT INTO "listings" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "New bike £100 "], ["user_id", 1], ["created_at", "2021-06-19 16:32:24.446490"], ["updated_at", "2021-06-19 16:32:24.446490"]]
---
  def create
    @listing = Listing.new(listing_params)

    respond_to do |format|
      if @listing.save